
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// Вот не хватает тернарок или... так, стоп
//	Если ПредопределенныйУзел(Элемент.ТекущаяСтрока) Тогда
//		Элементы.ФормаЗарегистрироватьИзменения.Доступность = Ложь;
//	Иначе
//		Элементы.ФормаЗарегистрироватьИзменения.Доступность = Истина;
//	КонецЕсли;

	// Радченко, ну и бред вы пишете!
	Элементы.ФормаЗарегистрироватьИзменения.Доступность =
		Не ПредопределенныйУзел(Элемент.ТекущаяСтрока);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредопределенныйУзел(Узел)
	// Смысл функции мне не совсем понятен. Обмен что, будет происходить ВСЕГДА из одного узла?
	Возврат Узел = ПланыОбмена.Филиалы.ЭтотУзел();
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьИзмененияНаСервере(Узел)
	//TODO: Вставить содержимое обработчика
	ПланыОбмена.ЗарегистрироватьИзменения(Узел);
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	ЗарегистрироватьИзмененияНаСервере(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры
