
&НаКлиенте
Перем ОтветПередДобавлением;

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы
&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	СтрТаблЧасти = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчетСуммыСтроки(СтрТаблЧасти);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	СтрТаблЧасти = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчетСуммыСтроки(СтрТаблЧасти);
КонецПроцедуры

&НаКлиенте
Асинх Процедура МатериалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Смысол использования переменной ОтветПередДобавлением для меня загадочен.
	// Типааа, что, 1С вдруг возьмет и "упадет" между строками с установкой переменной
	// и запуском цикла???
	Если ОтветПередДобавлением <> истина тогда
		СтандартнаяОбработка = ложь;
		Результат = Ждать ВопросАсинх("Добавить номенклатуру в табличную часть?", РежимДиалогаВопрос.ДаНет);
		Если Результат = КодВозвратаДиалога.Да тогда
			ОтветПередДобавлением = Истина;
			Для каждого ВыбрЭлем из ВыбранноеЗначение цикл
				Элементы.Материалы.ДобавитьСтроку();
				Элементы.Материалы.ТекущиеДанные.Материал = ВыбрЭлем;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для каждого ВыбрЭлем из ВыбранноеЗначение цикл
			НоваяСтрока = Объект.Материалы.Добавить();
			НоваяСтрока.Материал = ВыбрЭлем;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


&НаКлиенте
Асинх Процедура Подбор(Команда)
	// Вьетнамские флешбеки от изучения асинхрона...
	Результат = Ждать ВопросАсинх("Подобрать номенклатуру?", РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПарамФормы = новый структура("ЗакрыватьПриВыборе, МножественныйВыбор", истина, истина);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПарамФормы, Элементы.Материалы)
	КонецЕсли;
КонецПроцедуры
